mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/spi.c
//     if (phase != -1) {
//         init->CLKPhase = phase == 0 ? SPI_PHASE_1EDGE : SPI_PHASE_2EDGE;
//     }

//     if (bits != -1) {
//         init->DataSize = (bits == 16) ? SPI_DATASIZE_16BIT : SPI_DATASIZE_8BIT;
//     }

//     if (firstbit != -1) {
//         init->FirstBit = firstbit;
//     }
// }

// TODO allow to take a list of pins to use
void spi_init(const mp_obj_t *self_in) {
    machine_hard_spi_obj_t *self = (machine_hard_spi_obj_t*) self_in;
    const pin_obj_t *pins[4] = { NULL, NULL, NULL, NULL };

    if (0) { // needed for code structure, has no actual effect

    #if defined(MICROPY_HW_SPI0_SCK)
    } else if (self->spi_id == SPI_0) {
        self->spi_base = SSI0_BASE;
        self->periph = SYSCTL_PERIPH_SSI0;
        self->regs = (periph_spi_t*)SSI0_BASE;
        self->irqn = INT_SSI0;
        pins[0] = MICROPY_HW_SPI0_SCK;
        self->dma_channel_rx = dma_id_10;
        self->dma_channel_tx = dma_id_11;
        #if defined(MICROPY_HW_SPI0_MISO)
        pins[1] = MICROPY_HW_SPI0_MISO;
        #endif
        #if defined(MICROPY_HW_SPI0_MOSI)
        pins[2] = MICROPY_HW_SPI0_MOSI;
        #endif
        #if defined(MICROPY_HW_SPI0_FSS)
        if(!self->soft_fss) {
            pins[3] = MICROPY_HW_SPI0_FSS;
        }
        #endif
    #endif
    #if defined(MICROPY_HW_SPI1_SCK)
    } else if (self->spi_id == SPI_1) {
        self->spi_base = SSI1_BASE;
        self->periph = SYSCTL_PERIPH_SSI1;
        self->regs = (periph_spi_t*)SSI1_BASE;
        self->irqn = INT_SSI1;
        self->dma_channel_rx = dma_id_10;
        self->dma_channel_tx = dma_id_11;
        pins[0] = MICROPY_HW_SPI1_SCK;
        #if defined(MICROPY_HW_SPI1_MISO)
        pins[1] = MICROPY_HW_SPI1_MISO;
        #endif
        #if defined(MICROPY_HW_SPI1_MOSI)
        pins[2] = MICROPY_HW_SPI1_MOSI;
        #endif
        #if defined(MICROPY_HW_SPI1_FSS)
        if(!self->soft_fss) {
            pins[3] = MICROPY_HW_SPI1_FSS;
        }
        #endif
    #endif
    #if defined(MICROPY_HW_SPI2_SCK)
    } else if (self->spi_id == SPI_2) {
        self->spi_base = SSI2_BASE;
        self->periph = SYSCTL_PERIPH_SSI2;
        self->regs = (periph_spi_t*)SSI2_BASE;
        self->irqn = INT_SSI2;
        self->dma_channel_rx = dma_id_12;
        self->dma_channel_tx = dma_id_13;
        pins[0] = MICROPY_HW_SPI2_SCK;
        #if defined(MICROPY_HW_SPI2_MISO)
        pins[1] = MICROPY_HW_SPI2_MISO;
        #endif
        #if defined(MICROPY_HW_SPI2_MOSI)
        pins[2] = MICROPY_HW_SPI2_MOSI;
        #endif
        #if defined(MICROPY_HW_SPI2_FSS)
        if(!self->soft_fss) {
            pins[3] = MICROPY_HW_SPI2_FSS;
        }
        #endif
    #endif
    #if defined(MICROPY_HW_SPI3_SCK)
    } else if (self->spi_id == SPI_3) {
        self->spi_base = SSI3_BASE;
        self->periph = SYSCTL_PERIPH_SSI3;
        self->regs = (periph_spi_t*)SSI3_BASE;
        self->irqn = INT_SSI3;
        self->dma_channel_rx = dma_id_14;
        self->dma_channel_tx = dma_id_15;
        pins[0] = MICROPY_HW_SPI3_SCK;
        #if defined(MICROPY_HW_SPI3_MISO)
        pins[1] = MICROPY_HW_SPI3_MISO;
        #endif
        #if defined(MICROPY_HW_SPI3_MOSI)
        pins[2] = MICROPY_HW_SPI3_MOSI;
        #endif
        #if defined(MICROPY_HW_SPI3_FSS)
        if(!self->soft_fss) {
            pins[3] = MICROPY_HW_SPI3_FSS;
        }
        #endif
    #endif
    } else {
        // SPI does not exist for this board (shouldn't get here, should be checked by caller)
        return;
    }

    // init the GPIO lines
    for (uint i = 0; i < (self->soft_fss ? 3 : 4); i++) {
        if (pins[i] == NULL) {
            continue;
        }
        mp_hal_pin_config_alt(pins[i], PIN_FN_SSI, self->spi_id);
        // idle_high_polarity
        if(i==0 && (self->protocol & 0x1) ) MAP_GPIOPadConfigSet(pins[i]->gpio, pins[i]->pin_mask, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD_WPU);
    }

    // init the SPI device

    SysCtlPeripheralEnable(self->periph);
    while(!SysCtlPeripheralReady(self->periph));
    IntDisable(self->irqn);
    SSIDisable(self->spi_base);
    
    SSIClockSourceSet(self->spi_base, SSI_CLOCK_SYSTEM);
    SSIConfigSetExpClk(self->spi_base, MAP_SysCtlClockGet(), self->protocol, self->mode, self->baudrate, self->bits);
    

    if(self->dma_enabled == SSI_DMA_RX)
    {
        dma_init(self->dma_channel_rx, DMA_CHANNEL_RX);
    }
    else if (self->dma_enabled == SSI_DMA_TX)
    {
        dma_init(self->dma_channel_tx, DMA_CHANNEL_TX);
    }
    else if (self->dma_enabled == (SSI_DMA_TX | SSI_DMA_RX))
    {
        /* code */
        dma_init(self->dma_channel_tx, DMA_CHANNEL_TX);
        dma_init(self->dma_channel_rx, DMA_CHANNEL_RX);
    }

    SSIDMADisable(self->spi_base, SSI_DMA_TX | SSI_DMA_RX);
    SSIDMAEnable(self->spi_base, self->dma_enabled);
    

    SSIEnable(self->spi_base);
}

void spi_deinit(const mp_obj_t *self_in) {
    machine_hard_spi_obj_t* self = (machine_hard_spi_obj_t*) self_in;
    SSIDisable(self->spi_base);
    SysCtlPeripheralDisable(self->periph);
}



/******************************************************************************/
// Implementation of hard SPI for machine module

// Waits at most timeout milliseconds for SSI flag to be set.
// Returns true if flag is/was set, false on timeout.
STATIC bool spi_tx_wait(machine_hard_spi_obj_t *self, uint32_t timeout) {
    uint32_t start = mp_hal_ticks_ms();
    for (;;) {
        if (self->regs->SR & SSI_SR_TNF) {
            return true;
        }
        if (timeout == 0 || mp_hal_ticks_ms() - start >= timeout) {
            return false; // timeout
        }
        MICROPY_EVENT_POLL_HOOK
    }
}

STATIC bool spi_rx_wait(machine_hard_spi_obj_t *self, uint32_t timeout) {
    uint32_t start = mp_hal_ticks_ms();
    for (;;) {
        if (self->regs->SR & SSI_SR_RNE) {
            return true;
        }
        if (timeout == 0 || mp_hal_ticks_ms() - start >= timeout) {
            return false; // timeout
        }
        MICROPY_EVENT_POLL_HOOK
    }
}

