mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/spi.c
STATIC bool spi_wait_flag_unset(machine_hard_spi_obj_t *self, uint32_t flag, uint32_t timeout) {
    // Note: we don't use WFI to idle in this loop because UART tx doesn't generate
    // an interrupt and the flag can be set quickly if the baudrate is large.
    uint32_t start = mp_hal_ticks_ms();
    for (;;) {
        if (!(self->regs->SR & flag)) {
            return true;
        }
        if (timeout == 0 || mp_hal_ticks_ms() - start >= timeout) {
            return false; // timeout
        }
        MICROPY_EVENT_POLL_HOOK
    }
}

mp_uint_t spi_tx_only(machine_hard_spi_obj_t *self, const uint16_t* data, size_t len, uint32_t word_timeout, int *errcode) {
    uint num_tx = 0;
    uint32_t dummy;
    volatile uint32_t dat;

    /* when dmaa is enabled for trnsmitt */
    if(self->dma_enabled == SSI_DMA_TX)
    {
        spi_dma_tx(self->dma_channel_tx, data,(uint8_t*) (self->spi_base + SSI_O_DR), self->bits,len);
        return len;
    }
    else {
        while(num_tx < len) {

            if(!spi_tx_wait(self, word_timeout)) {
                *errcode = MP_ETIMEDOUT;
                return num_tx;
            }
            // Reversing bit order of data
            if(self->lsb_first) {
                asm volatile("rbit %1,%0" : "=r" (dat) : "r" (data[num_tx]));
                dat >>= (32 - self->bits);
                //nop here?
                SSIDataPutNonBlocking(self->spi_base, dat);
            } else {
                SSIDataPutNonBlocking(self->spi_base, data[num_tx]);
            }   
            SSIDataGetNonBlocking(self->spi_base, &dummy);
            num_tx++;
        }

        if(!spi_wait_flag_unset(self, SSI_SR_BSY, word_timeout)) {
            *errcode = MP_ETIMEDOUT;
            return num_tx;
        }

        *errcode = 0;
        return num_tx;
    }
}

mp_uint_t spi_rx_only(machine_hard_spi_obj_t *self, uint16_t* data, size_t len, uint32_t word_timeout, int *errcode) {
    uint num_rx = 0;
    uint32_t dummy = 0;
    uint32_t dumm;

        /* when dmaa is enabled for receive */
    if(self->dma_enabled == SSI_DMA_RX)
    {
        spi_dma_rx(self->dma_channel_rx,(uint8_t*) (self->spi_base + SSI_O_DR), data, self->bits,len);
        return len;
    }
    else{
        while(num_rx < len) {

            if(!spi_rx_wait(self, word_timeout)) {
                *errcode = MP_ETIMEDOUT;
                return num_rx;
            }

            SSIDataPutNonBlocking(self->spi_base, dummy);
            num_rx += SSIDataGetNonBlocking(self->spi_base, &dumm);
            // Reversing bit order of data
            if(self->lsb_first) {
                asm volatile("rbit %1,%0" : "=r" (dumm) : "r" (dumm));
                dumm >>= (32 - self->bits);
                //nop here?
            }
            data[num_rx] = dumm;
        }

        if(!spi_wait_flag_unset(self, SSI_SR_BSY, word_timeout)) {
            *errcode = MP_ETIMEDOUT;
            return num_rx;
        }

        *errcode = 0;
        return num_rx;
    }
}


mp_uint_t spi_rx_tx(machine_hard_spi_obj_t *self, const uint16_t* data_tx, uint16_t* data_rx, size_t len, uint32_t word_timeout, int *errcode) {
    uint num_rtx = 0;
    uint32_t dumm;
    volatile uint32_t dat;

    /* when dmaa is enabled for receive and transmit */
    if(self->dma_enabled == (SSI_DMA_TX | SSI_DMA_RX))
    {
        spi_dma_rx(self->dma_channel_rx,(uint8_t*) (self->spi_base + SSI_O_DR), data_rx, self->bits,len);
        spi_dma_tx(self->dma_channel_tx, data_tx,(uint8_t*) (self->spi_base + SSI_O_DR), self->bits,len);
        return len;
    }
    else
    {
        while(num_rtx < len) {

            // if(!spi_rx_wait(self, word_timeout)) {
                //   *errcode = MP_ETIMEDOUT;
                // return num_rtx;
                //}

            /* if(!spi_tx_wait(self, word_timeout)) {
                    *errcode = MP_ETIMEDOUT;
                    return num_rtx;
                }*/

                // Reversing bit order of data
            if(self->lsb_first) {
                asm volatile("rbit %1,%0" : "=r" (dat) : "r" (data_tx[num_rtx]));
                dat >>= (32 - self->bits);
                //nop here?
                SSIDataPutNonBlocking(self->spi_base, dat);
            } else {
                SSIDataPutNonBlocking(self->spi_base, data_tx[num_rtx]);
            }   
            int a;
            for(int i = 0; i<100000; i++)
            {
                a++;
            }
            SSIDataGetNonBlocking(self->spi_base, &dumm);
            if(self->lsb_first) {
                asm volatile("rbit %1,%0" : "=r" (dumm) : "r" (dumm));
                dumm >>= (32 - self->bits);
                //nop here?
            }
            data_rx[num_rtx] = dumm;
            num_rtx++;
        }

        if(!spi_wait_flag_unset(self, SSI_SR_BSY, word_timeout)) {
            *errcode = MP_ETIMEDOUT;
            return num_rtx;
        }

    *errcode = 0;
    return num_rtx;
    }
}

// A transfer of "len" bytes should take len*8*1000/baudrate milliseconds.
// To simplify the calculation we assume the baudrate is never less than 8kHz
// and use that value for the baudrate in the formula, plus a small constant.
#define SPI_TRANSFER_TIMEOUT(len) ((len) + 100)

STATIC void spi_transfer(const mp_obj_t *self_in, size_t len, const uint16_t *src, uint16_t *dest, uint32_t timeout) {
    mp_int_t status = 0;
    uint bytes_trans = 0;
    machine_hard_spi_obj_t* self = (machine_hard_spi_obj_t*) self_in;
    
    if (dest == NULL) {
        // send only
        if (len <= 4 || query_irq() == IRQ_STATE_DISABLED) {
            bytes_trans = spi_tx_only(self, src, len, timeout, &status);
        } else {
            // TODO
        }
    } else if (src == NULL) {
        // receive only
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            bytes_trans = spi_rx_only(self, dest, len, timeout, &status);
        } else {
            // TODO
        }
    } else {
        // send and receive
        if (len <= 16 || query_irq() == IRQ_STATE_DISABLED) {
            bytes_trans = spi_rx_tx(self, src, dest, len, timeout, &status);
        } else {
            // TODO
        }
    }

    if (status != 0) {
        mp_hal_raise(status);
    }
    if (bytes_trans != len) {
        mp_hal_raise(MP_EFAULT);
    }
}

STATIC void machine_hard_spi_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_hard_spi_obj_t *spi = (machine_hard_spi_obj_t*) self_in;;

    mp_printf(print, "SPI(%u", spi->spi_id);
    
    if(spi->mode == SSI_MODE_MASTER) {
        mp_printf(print, ", SPI.MASTER");
            
        mp_printf(print, ", baudrate=%u", spi->baudrate);
            
    } else if(spi->mode == SSI_MODE_SLAVE){
        mp_printf(print, ", SPI.SLAVE");
    } else if(spi->mode == SSI_MODE_SLAVE_OD) {
        mp_printf(print, ", SPI.SLAVE_OD");
    }
    
    mp_printf(print, ", protocol=");
    if(spi->protocol == SSI_FRF_MOTO_MODE_0) mp_printf(print, "SPI0");
    else if(spi->protocol == SSI_FRF_MOTO_MODE_1) mp_printf(print, "SPI1");
    else if(spi->protocol == SSI_FRF_MOTO_MODE_2) mp_printf(print, "SPI2");
    else if(spi->protocol == SSI_FRF_MOTO_MODE_3) mp_printf(print, "SPI3");
    else if(spi->protocol == SSI_FRF_TI) mp_printf(print, "TI");
    else if(spi->protocol == SSI_FRF_NMW) mp_printf(print, "MICROWIRE");
    mp_printf(print, ", bits=%u)", spi->bits);
}

STATIC mp_obj_t machine_hard_spi_init_helper(mp_obj_t* self_in, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_mode, ARG_id, ARG_baudrate,/* ARG_prescaler,*/ ARG_polarity, ARG_phase, ARG_bits, ARG_fss, ARG_protocol, ARG_dma, ARG_firstbit, ARG_sck, ARG_mosi, ARG_miso };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_mode,     MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = SSI_MODE_MASTER} }, // Default as master
        { MP_QSTR_id,       MP_ARG_OBJ, {.u_obj = MP_OBJ_NEW_SMALL_INT(-1)} },
        { MP_QSTR_baudrate, MP_ARG_INT, {.u_int = 500000} },
        //{ MP_QSTR_prescaler, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0xFF} },       // max prescaler
        { MP_QSTR_polarity, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} }, // for api compat         
        { MP_QSTR_phase,    MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} }, // for api compat
        //{ MP_QSTR_dir,      MP_ARG_KW_ONLY | MP_ARG_INT,  {.u_int = SSI_CR1_DIR} },
        { MP_QSTR_bits,     MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 8} }, // word length
        { MP_QSTR_fss,   MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false}}, // chip select mode (software or hardware)
        { MP_QSTR_protocol,      MP_ARG_KW_ONLY | MP_ARG_INT,  {.u_int = -1} }, // SSI frame format
        { MP_QSTR_dma,      MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0}}, // no dma
        { MP_QSTR_firstbit, MP_ARG_KW_ONLY | MP_ARG_INT,  {.u_int = 0} }, // for api compat, no hardware support
        //{ MP_QSTR_ti,       MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false} },
        //{ MP_QSTR_crc,      MP_ARG_KW_ONLY | MP_ARG_OBJ,  {.u_obj = mp_const_none} },
        { MP_QSTR_sck,      MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} }, // api compat, only fixed values, not implemented
        { MP_QSTR_mosi,     MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_miso,     MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

