mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/spi.c
    machine_hard_spi_obj_t *self = (machine_hard_spi_obj_t*)self_in;    

    // here we would check the sck/mosi/miso pins and configure them, but it's not implemented
    if (args[ARG_sck].u_obj != MP_OBJ_NULL
        || args[ARG_mosi].u_obj != MP_OBJ_NULL
        || args[ARG_miso].u_obj != MP_OBJ_NULL) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, MP_ERROR_TEXT("explicit choice of sck/mosi/miso is not implemented")));
    }

    // set the SPI configuration values
    if(args[ARG_mode].u_int > 2) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, MP_ERROR_TEXT("Mode accepts only MASTER or SLAVE")));
    }
    self->mode = args[ARG_mode].u_int;
  
    if(args[ARG_bits].u_int >= 16 || args[ARG_bits].u_int <= 4) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, MP_ERROR_TEXT("invalid word length, only values 4..16 are available")));
    }
    self->bits = args[ARG_bits].u_int;

    // if(args[ARG_prescaler].u_int & 0xFFFFFF00) {
    //     mp_raise_ValueError( "prescaler only 2-254!"));
    // }
    // uint8_t prescale = args[ARG_prescaler].u_int;

    self->lsb_first = (bool) (args[ARG_firstbit].u_int & 0x1);

    if(!self->mode) {
        if(args[ARG_baudrate].u_int >= 25000000) {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, MP_ERROR_TEXT("baudrate too high, max 25 Mbaud as master")));
        }
    } else {
        if(args[ARG_baudrate].u_int >= 6666666) {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, MP_ERROR_TEXT("baudrate too high, max 6.66 Mbaud as slave")));
        }
    }
    self->baudrate = args[ARG_baudrate].u_int;

    uint8_t phase = (uint8_t)args[ARG_phase].u_int & 0xFF;
    uint8_t polarity = (uint8_t)args[ARG_polarity].u_int & 0xFF;
    uint32_t protocol = args[ARG_protocol].u_int;

    // support both polarity/phase and protocol but only one at a time, protocol takes priority
    if(polarity < 0  || polarity > 1) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, MP_ERROR_TEXT("polarity not correct; IDLE_LOW or IDLE_HIGH")));
    }
    if(phase < 0 || phase > 1) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, MP_ERROR_TEXT("phase not correct; FIRST_EDGE or SECOND_EDGE")));
    }
    if(protocol != -1){
        if(!(protocol == SSI_FRF_MOTO_MODE_0 || protocol == SSI_FRF_MOTO_MODE_1  ||
            protocol == SSI_FRF_MOTO_MODE_2 || protocol == SSI_FRF_MOTO_MODE_3  ||
            protocol == SSI_FRF_TI || protocol == SSI_FRF_NMW)) {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, MP_ERROR_TEXT("protocol not supported, please use SPI0..3, TI or MICROWIRE!")));
        }
        self->protocol = protocol;
    } else {
        self->protocol = ((phase & 0x1) << 1) | ((polarity & 0x1) << 1);
    }

//    if(args[ARG_fss].u_int != 0 || args[ARG_fss].u_int != 1) {
//        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "fss only accepts CS_HARD(0) or CS_SOFT(1)"));
//    }
    // Automatic or Manually assert chipselect? Only applicable in SPI mode
    if(!(self->protocol & 0xF0)) {
        self->soft_fss = args[ARG_fss].u_bool;
    } else {
        self->soft_fss = false;
    }

    if(!(args[ARG_dma].u_int <= 3 && args[ARG_dma].u_int >= 0)) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, MP_ERROR_TEXT("dma accepts only DMA_NONE(0), DMA_RX(1), DMA_TX(2) or DMA_BOTH(3)")));
    }
    self->dma_enabled = args[ARG_dma].u_int;
    
    // init the SPI bus
    spi_init(self_in);

    return mp_const_none;
}

STATIC mp_obj_t machine_hard_spi_init(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args) {  
    return machine_hard_spi_init_helper(args[0], n_args - 1, args + 1, kw_args);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(machine_spi_init_obj, 1, machine_hard_spi_init);

/**
 * constructor for SPI object
 */
mp_obj_t machine_hard_spi_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {

    // check arguments
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    // find SPI port
    spi_id_t spi_id = spi_find(all_args[0]);

    // create dynamic peripheral object
    machine_hard_spi_obj_t *self;

    // get SPI object
    if (MP_STATE_PORT(machine_spi_obj_all)[spi_id - 1] == NULL) {
        // create new SSI object
        self = m_new0(machine_hard_spi_obj_t, 1);
        self->base.type = &machine_hard_spi_type;
        self->spi_id = spi_id;
        MP_STATE_PORT(machine_spi_obj_all)[spi_id - 1] = self;
    } else {
        // reference existing SSI object
        self = MP_STATE_PORT(machine_spi_obj_all)[spi_id - 1];
    }

    if (n_args > 1 || n_kw > 0) {
        // start the peripheral
        mp_map_t kw_args;
        mp_map_init_fixed_table(&kw_args, n_kw, all_args + n_args);
        mp_obj_t* self_out = (mp_obj_t*) self;
        machine_hard_spi_init_helper(self_out, n_args - 1, all_args + 1, &kw_args);
    }

    return MP_OBJ_FROM_PTR(self);
}

STATIC mp_obj_t machine_hard_spi_deinit(mp_obj_t self_in) {
    // machine_hard_spi_obj_t *self = (machine_hard_spi_obj_t*)self_in;
    spi_deinit(&self_in);
    return mp_const_none;
}

STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_spi_deinit_obj, machine_hard_spi_deinit);


// STATIC mp_uint_t machine_hard_spi_transmit(const machine_hard_spi_obj_t *self, size_t len, const uint8_t *src, uint32_t timeout) {
    
// }

STATIC void machine_hard_spi_transfer(mp_obj_base_t *self_in, size_t len, const uint16_t *src, uint16_t *dest) {
    // machine_hard_spi_obj_t *self = (machine_hard_spi_obj_t*)self_in;
    spi_transfer((mp_obj_t*)self_in, len, src, dest, SPI_TRANSFER_TIMEOUT(len));
}

STATIC mp_obj_t mp_machine_hard_spi_read(size_t n_args, const mp_obj_t *args) {
    vstr_t vstr;
    vstr_init_len(&vstr, mp_obj_get_int(args[1]));
    memset(vstr.buf, n_args == 3 ? mp_obj_get_int(args[2]) : 0, vstr.len);
    machine_hard_spi_transfer(args[0], vstr.len, (uint16_t*)vstr.buf, (uint16_t*)vstr.buf);
    return mp_obj_new_str_from_vstr(&mp_type_bytes, &vstr);
}
MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mp_machine_hard_spi_read_obj, 2, 3, mp_machine_hard_spi_read);

STATIC mp_obj_t mp_machine_hard_spi_readinto(size_t n_args, const mp_obj_t *args) {
    mp_buffer_info_t bufinfo;
    mp_get_buffer_raise(args[1], &bufinfo, MP_BUFFER_WRITE);
    memset(bufinfo.buf, n_args == 3 ? mp_obj_get_int(args[2]) : 0, bufinfo.len);
    machine_hard_spi_transfer(args[0], bufinfo.len, bufinfo.buf, bufinfo.buf);
    return mp_const_none;
}
MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mp_machine_hard_spi_readinto_obj, 2, 3, mp_machine_hard_spi_readinto);

STATIC mp_obj_t mp_machine_hard_spi_write(mp_obj_t self, mp_obj_t wr_buf) {
    mp_buffer_info_t src;
    mp_get_buffer_raise(wr_buf, &src, MP_BUFFER_READ);
    if(src.typecode == 0x48)
    {
        src.len = src.len/2;
    }
    machine_hard_spi_transfer(self, src.len, (const uint16_t*)src.buf, NULL);
    return mp_const_none;
}
MP_DEFINE_CONST_FUN_OBJ_2(mp_machine_hard_spi_write_obj, mp_machine_hard_spi_write);

